package com.example.savvy_android.myPage.activity

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import androidx.core.content.ContextCompat
import androidx.core.splashscreen.SplashScreen.Companion.installSplashScreen
import com.example.savvy_android.R
import com.example.savvy_android.databinding.ActivityMypageConditionBinding

class MypageConditionActivity : AppCompatActivity() {
    private lateinit var binding: ActivityMypageConditionBinding

    override fun onCreate(savedInstanceState: Bundle?) {
        installSplashScreen() // splash screen 설정, 관리 API 함수
        binding = ActivityMypageConditionBinding.inflate(layoutInflater)
        super.onCreate(savedInstanceState)
        setContentView(binding.root)

        // 배경 색 지정
        window.decorView.setBackgroundColor(ContextCompat.getColor(this, R.color.white))

        // 뒤로 가기 버튼 클릭 이벤트
        binding.conditionArrowIv.setOnClickListener {
            finish()
        }

        binding.conditionTv.text =
            "제 1 조 (목적)\n" +
                    "\n" +
                    "본 약관은 SAVVY의 서비스의 이용과 관련하여 회사와 이용자와의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.\n" +
                    "\n" +
                    "제 2 조 (정의)\n" +
                    "본 약관에서 사용하는 용어의 정의는 다음과 같습니다.\n" +
                    "\n" +
                    "“서비스”라 함은 SAVVY가 제공하는 여행 정보 플랫폼 관련 서비스로서, 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 “이용자”가 이용할 수 있는 “회사”가 제공하는 SAVVY 앱(App) 의 제반 서비스를 의미합니다.\n" +
                    "“이용자”라 함은 회사의 “서비스”에 접속하여 본 약관에 따라 “회사”가 제공하는 “서비스”를 이용하는 회원을 말합니다. \n" +
                    "“회원”이라 함은 회사의 “서비스”에 접속하여 본 약관에 따라 “회사”와 이용계약을 체결하고 “회사”가 제공하는 “서비스”를 이용하는 고객을 말합니다.\n" +
                    "“아이디(ID)”라 함은 “회원”의 식별과 “서비스” 이용을 위하여 “회원”이 정하고 “회사”가 승인하는 전자우편 주소를 의미합니다.\n" +
                    "“비밀번호”라 함은 “회원”이 부여 받은 아이디와 일치되는 “회원”임을 확인하고 비밀보호를 위해 ”회원” 자신이 정한 문자 또는 숫자의 조합을 의미합니다.\n" +
                    "“다이어리”라 함은 “서비스”에 업로드 된 “콘텐츠” 및 “콘텐츠”를 구성하는 각종 파일과 링크, “회원”들의 댓글 등을 포함하는 정보를 의미합니다.\n" +
                    "“여행 계획서”라 함은 “서비스”에 업로드 된 “콘텐츠”를 포함하는 정보를 의미합니다.\n" +
                    "\n" +
                    "제 3 조 (약관의 게시와 개정)\n" +
                    "“회사”는 이 약관의 내용과 전자우편 주소를 “이용자”가 쉽게 알 수 있도록 별도의 연결화면에 게시합니다.\n" +
                    "“회사”는 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「전자문서 및 전자거래기본법」, 「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「방문판매 등에 관한 법률」, 「소비자기본법」 등 관련 법을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.\n" +
                    "“회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 제 1항의 방식에 따라 그 재정약관을 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, “이용자”에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 “회사”는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 “이용자”가 알기 쉽도록 표시합니다.\n" +
                    "“회사”가 전항에 따라 개정약관을 공지 또는 통지하면서 “이용자”에게 30일 기간 내에 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 “이용자”가 명시적으로 거부의 의사표시를 하지 아니한 경우 “이용자”가 개정약관에 동의한 것으로 봅니다.\n" +
                    "“이용자”가 개정약관의 적용에 동의하지 않는 경우 “회사”는 개정 약관의 내용을 적용할 수 없으며, 이 경우 “이용자”는 이용계약을 해지할 수 있습니다.\n" +
                    "“회사”가 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 “이용자”가 개정약관 조항의 적용을 받기를 원하는 뜻을 제4항에 의한 개정약관의 공지기간 내에 “회사”에 송신하여 “회사”의 동의를 받은 경우에는 개정약관 조항이 적용됩니다.\n" +
                    "본 약관은 서비스를 이용하고자 하는 모든 “이용자”에 대하여 그 효력을 발생하며, 본 약관에 동의하지 않거나 약관을 준수하지 않는 경우 “회사”의 앱(App)에 대한 접근 및 모든 서비스의 이용은 금지됩니다. 단, 일부 특정 서비스의 경우 본 약관이 아닌 “회사”에 해당 서비스를 제공하는 사업자의 약관이 적용됩니다(자세한 안내는 각 서비스 영역에 별도 표시).\n" +
                    "“이용자”는 회사의 앱(App)에 접근하여 서비스를 이용할 경우 본 약관 및 관련 운영 정책을 확인 및 준수하고, 약관 변경에 대하여 주의의무를 다하여야 하며, 변경된 약관의 부지로 인한 “이용자”의 피해는 “회사”가 책임지지 않습니다.\n" +
                    "본 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다.\n" +
                    "제 4 조 (이용계약 체결)\n" +
                    "\n" +
                    "이용계약은 “회원”이 되고자 하는 자(이하 “가입신청자”)가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을 하고 “회사”가 이러한 신청에 대하여 승낙함으로써 체결됩니다.\n" +
                    "“회사”는 “가입신청자”의 신청에 대하여 “서비스” 이용을 승낙함을 원칙으로 합니다. 다만, “회사”는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.\n" +
                    "가입신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 단 “회사”의 회원 재가입 승낙을 얻은 경우에는 예외로 함.\n" +
                    "타인의 명의를 이용한 경우\n" +
                    "허위의 정보를 기재하거나, “회사”가 제시하는 내용을 기재하지 않은 경우\n" +
                    "14세 미만 아동이 가입 신청을 하는 경우\n" +
                    "“이용자”의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우\n" +
                    "관계 법령에 위배되거나 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우\n" +
                    "기타 회원으로 등록하는 것이 “회사”의 기술상 현저히 지장이 있다고 판단되는 경우 및 “회사”가 합리적인 판단에 의하여 필요하다고 인정하는 경우\n" +
                    "제1항에 따른 신청에 있어 “회사”는 “회원”의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.\n" +
                    "“회사”는 서비스관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.\n" +
                    "제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, “회사”는 원칙적으로 이를 가입신청자에게 알리도록 합니다.\n" +
                    "이용계약의 성립 시기는 “회사”가 가입완료를 신청절차 상에서 표시한 시점으로 합니다.\n" +
                    "“회원”은 회원가입 시 등록한 사항에 변경이 있는 경우, 즉시 “회사”에 대하여 그 변경사항을 알려야 합니다.\n" +
                    "제 5 조 (회원정보의 변경)\n" +
                    "\n" +
                    "“회원”은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 아이디 등은 수정이 불가능합니다.\n" +
                    "“회원”은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 하거나 전자우편 기타 방법으로 “회사”에 대하여 그 변경사항을 알려야 합니다.\n" +
                    "제2항의 변경사항을 “회사”에 알리지 않아 발생한 불이익에 대하여 “회사”는 책임지지 않습니다.\n" +
                    "제 6 조 (개인정보보호 의무)\n" +
                    "\n" +
                    "“회사”는 “정보통신망법” 등 관계 법령이 정하는 바에 따라 “이용자”의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 “회사”의 개인정보처리방침이 적용됩니다. 다만, “회사”의 공식 사이트 이외의 링크된 사이트에서는 “회사”의 개인정보처리방침이 적용되지 않습니다.\n" +
                    "\n" +
                    "제 7 조 (“회원”의 “아이디” 및 “비밀번호”의 관리에 대한 의무)\n" +
                    "\n" +
                    "“회원”의 “아이디”와 “비밀번호”에 관한 관리책임은 “회원”에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.\n" +
                    "“회사”는 “회원”의 “아이디”가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 “회사” 및 “회사”의 운영자로 오인한 우려가 있는 경우, 해당 “아이디”의 이용을 제한할 수 있습니다.\n" +
                    "“회원”은 “아이디” 및 “비밀번호”가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 즉시 비밀번호를 수정하는 등의 조치를 취함과 동시에 “회사”에 통지하고 “회사”의 안내에 따라야 합니다.\n" +
                    "제3항의 경우에 해당 “회원”이 “회사”에 그 사실을 통지하지 않거나, 통지한 경우에도 “회사”의 안내에 따르지 않아 발생한 불이익에 대하여 “회사”는 책임지지 않습니다.\n" +
                    "“회사”는 “회사”의 귀책사유로 인한 경우를 제외하고 “회원”의 “아이디” 및 “비밀정보”의 유출, 양도, 대여, 공유 등으로 인한 손실이나 손해에 대하여 아무런 책임을 지지 않습니다.\n" +
                    "제 8 조 (“이용자”에 대한 통지)\n" +
                    "\n" +
                    "“회사”가 “이용자”에 대한 통지를 하는 경우 본 약관에 별도 규정이 없는 한 “이용자”가 “회사”에 제출한 전자우편주소, 휴대폰(SMS, 알림창 등) 등으로 할 수 있습니다.\n" +
                    "“회사”는 불특정다수의 “이용자”에 대한 통지의 경우 7일 이상 “서비스”의 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다. 다만, “이용자” 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.\n" +
                    "제 9 조 (“회사”의 의무)\n" +
                    "\n" +
                    "“회사”는 관련법과 본 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 “서비스”를 제공하기 위하여 최선을 다하여 노력합니다.\n" +
                    "“회사”는 “이용자”가 안전하게 “서비스”를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다.\n" +
                    "“회사”는 서비스이용과 관련하여 발생하는 이용자의 불만 또는 피해구제요청을 적절하게 처리할 수 있도록 필요한 인력 및 시스템을 구비합니다.\n" +
                    "“회사”는 서비스이용과 관련하여 “이용자”로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. “이용자”가 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 “이용자”에게 처리과정 및 결과를 전달합니다.\n" +
                    "제 10 조 (“이용자”의 의무)\n" +
                    "\n" +
                    "“이용자”는 관련법령, 본 약관의 규정, 이용안내 및 “서비스”와 관련하여 공지한 주의사항, “회사”가 통지하는 사항 등을 준수하여야 하며, 기타 “회사”의 업무에 방해되는 행위를 하여서는 안 됩니다.\n" +
                    "“이용자”는 상품 등을 구매하기 전에 반드시 회사가 제공하는 상품 등의 상세 내용과 거래의 조건을 정확하게 확인한 후 구매를 신청하여야 합니다. 구매하려는 상품 등의 상세내용과 거래의 조건을 확인하지 않고 구매하여 발생하는 손해에 대하여 “이용자”가 책임을 부담합니다.\n" +
                    "“이용자”는 본 약관 및 회사가 서비스와 관련하여 고지하는 내용을 준수하여야 하며, 약관 및 고지내용을 위반하거나 이행하지 아니하여 발생하는 손해에 대하여 책임을 부담합니다.\n" +
                    "“이용자”는 “회사”가 서비스를 안전하게 제공할 수 있도록 “회사”에 협조하여야 하며, “회사”가 “이용자”의 본 약관 위반행위를 발견하여 “이용자”에게 해당 위반행위에 대하여 소명을 요청할 경우 “이용자”는 “회사”의 요청에 적극 응하여야 합니다.\n" +
                    "\n" +
                    "제 11 조 (“이용자”의 금지행위)\n" +
                    "\n" +
                    "“이용자”는 다음 각호의 행위를 하여서는 안됩니다.\n" +
                    "“회사”가 제공하는 “서비스” 이용방법에 의하지 아니하고, 회사의 앱(App)과 서버 간의 전송 내용 등을 확인하거나 소스 코드 등의 추출을 시도하기 위해 패킷 캡쳐 및 이와 유사 ∙ 동일한 기능의 프로그램 등을 사용하여 회사의 앱(App)∙서버에 접근하거나 해당 프로그램 등을 통하여 알게 된 소스 코드(URL포함) 및 명령구문 등을 사용하여 “회사”의 앱(App)∙서버에 접근하는 행위\n" +
                    "“회사”의 명시적인 사전 서면 허가 없이 데이터 등을 추출하기 위하여 로봇(봇), 크롤러, 스파이더, 스크래퍼, 매크로 프로그램 또는 기타 자동화 수단이나 수동 프로세스를 이용하여 회사의 앱(App)∙서버에 접근하거나 “서비스”에 포함된 콘텐츠 및 정보를 모니터링, 복제, 수집, 확인, 정리, 사용하는 등의 행위\n" +
                    "“회사”의 앱(App)∙서버에서 로봇 배제 헤더의 제한 사항을 위반하거나 회사의 앱(App)∙서버 및 서비스에 대한 접근을 방지 또는 제한하기 위해 채택되는 기타 조치를 우회 또는 회피하는 일체의 행위(예: IP를 지속적으로 바꿔가며 접속하는 행위, Captcha를 외부 솔루션 등을 통해 우회하거나 무력화하는 행위 등) 및 이를 통하여 “회사”의 앱(App)∙서버에 접근하는 행위\n" +
                    "“회사”의 사전 서면 승인 없이 회사의 앱(App), 서비스, 콘텐츠, “회사”의 브랜딩 또는 페이지 레이아웃이나 디자인 등을 사용, 복제, 전시, 미러링, 프레이밍, 딥링크 하는 행위\n" +
                    "해킹, 비밀번호 마이닝 또는 기타 수단을 통해 “회사”의 앱(App)∙서버, 기타 관련 웹사이트, 다른 계정, 컴퓨터 시스템 및 네트워크 등에 대한 승인되지 않은 접속 권한을 얻기 위해 시도하는 행위 및 이를 통하여 “회사”의 앱(App)∙서버 등에 접근하는 행위\n" +
                    "타인의 명의, 카드정보, 계좌정보 등의 정보를 임의 수집, 도용하거나 허위 내용을 등록하여 “회사”가 제공하는 “서비스”를 이용하는 행위\n" +
                    "“회사”가 정하지 않은 비정상적인 방법으로 포인트, 캐시, 쿠폰 등을 취득하거나 사용하는 행위\n" +
                    "“회사” 및 기타 제3자의 저작권 등 지식재산권에 대한 침해행위\n" +
                    "“회사” 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위\n" +
                    "외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서 양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위\n" +
                    "구매의사 없이 반복적인 구매행위를 하는 행위\n" +
                    "“회사”가 제공하는 “서비스” 및 콘텐츠∙정보를 상업적이거나 경쟁적인 목적, “회사”의 사업 현황을 파악하기 위한 목적, 불법적이거나 비합법적인 목적, 또는 본 이용 약관에서 금지하는 목적 등으로 사용하기 위하여 “회사”의 앱(App)∙서버에 접근하는 일체의 행위\n" +
                    "“회사”가 제공하는 소프트웨어나 하드웨어 등을 개작하거나 해독, 리버스 엔지니어링, 디컴파일, 디스어셈블 및 기타 일체의 가공행위를 통하여 서비스를 복제, 분해 또는 모방 기타 변형하는 행위 및 이를 목적으로 또는 이를 통하여 알게된 소스코드(URL포함) 및 명령구문 등을 사용하여 “회사”의 앱(App)∙서버에 접근하는 행위\n" +
                    "기타 불법적이거나 부당한 행위\n" +
                    "“회사”는 “이용자”가 본 조의 금지행위를 행하는 경우 “서비스”의 일부 또는 전부를 이용 정지하거나 “서비스” 이용계약을 임의로 해지할 수 있으며, 이 경우 발생하는 손해에 대한 책임은 “이용자”가 부담합니다. “회사”는 필요한 경우 “이용자”의 금지행위 사실을 관련 정부기관 또는 사법기관에 통지할 수 있습니다.\n" +
                    "제 12 조 (“서비스”의 제공 등)\n" +
                    "\n" +
                    "회사는 아래와 같은 서비스를 제공합니다.\n" +
                    "여행 관련 콘텐츠 제공 서비스\n" +
                    "알림 서비스\n" +
                    "게시판형 서비스\n" +
                    "재화 또는 용역에 대한 정보 제공 및 구매계약의 체결 및 중개에 관한 서비스\n" +
                    "기타 “회사”가 추가 개발하거나 다른 회사와의 제휴계약 등을 통해 “회원”에게 제공하는 일체의 서비스\n" +
                    "기타 “회사”가 정하는 업무\n" +
                    "회사는 “서비스”를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다. 다만, 이러한 경우에는 그 내용을 사전에 공지합니다.\n" +
                    "“서비스”는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.\n" +
                    "“알림” 서비스는 SAVVY 서비스에 포함된 서비스로서 다른 사용자가 해당 사용자의 게시물에 댓글이나 답글, 좋아요를 남겼을 경우 알람을 보냅니다. \n" +
                    "“회사”는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.\n" +
                    "“회사”는 “서비스”에 관한 개별 안내, 상품 등에 대한 정보, 예약 시 유의사항, 취소, 환불 정책 등은 개별 서비스 이용안내, 소개 등을 통해 제공하고 있으며, “이용자”는 이를 충분히 숙지하고 “서비스”를 이용하여야 합니다. “회사”가 통신판매의 당사자가 아닌 통신판매중개자로서의 지위를 가지는 경우 “판매자”가 상품 등 이용에 관한 이용정책이나 예약에 관한 취소, 환불 정책을 별도로 운영하는 경우가 있을 수 있으므로, “이용자”는 상품 등 이용 또는 예약 시 반드시 그 내용을 확인해야 합니다. “이용자”가 이 내용을 제대로 숙지하지 못해 발생한 피해에 대해서는 “회사”가 책임을 부담하지 않습니다.\n" +
                    "\n" +
                    "제 13 조 (“서비스”의 변경)\n" +
                    "\n" +
                    "“회사”는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 “서비스”의 전부 또는 일부를 변경할 수 있습니다.\n" +
                    "“서비스”의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경 전에 해당 서비스 초기화면 또는 연결화면 등에 게시하여야 합니다.\n" +
                    "“회사”는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 “이용자”에게 별도의 보상을 하지 않습니다.\n" +
                    "“회사”는 재화 또는 용역의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공할 재화 또는 용역의 내용을 변경할 수 있습니다. 이 경우에는 변경된 재화 또는 용역의 내용 및 제공일자를 명시하여 현재의 재화 또는 용역의 내용을 게시한 곳에 즉시 공지합니다.\n" +
                    "“회사”가 제공하기로 “이용자”와 계약을 체결한 “서비스”의 내용을 재화 등의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를 이용자에게 통지 가능한 주소로 즉시 통지합니다.\n" +
                    "전항의 경우 “회사”는 이로 인하여 “이용자”가 입은 손해를 배상합니다. 다만, “회사”의 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.\n" +
                    "\n" +
                    "제 14 조 (“게시물”의 저작권)\n" +
                    "\n" +
                    "“회원”이 “서비스” 내에 게시한 “게시물”의 저작권은 해당 게시물의 저작자에게 귀속됩니다.\n" +
                    "“회사”가 “서비스” 내 게재 이외의 목적으로 게시물을 사용할 경우 “게시물”에 대한 게시자를 반드시 명시해야 합니다. 단, 게시자를 알 수 없는 익명 게시물 등의 경우에는 그러하지 아니합니다.\n" +
                    "“회사”는 제2항 이외의 방법으로 “회원”의 “게시물”을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 “회원”의 동의를 얻어야 합니다.\n" +
                    "“회사”와 상품구매 및 서비스이용 계약을 체결하지 않고 이용자가 “회사”에 게시된 정보를 사용으로 인한 피해는 전적으로 이용자에게 있습니다.\n" +
                    "\n" +
                    "제 15 조 (“게시물”의 관리)\n" +
                    "\n" +
                    "“회원”은 서비스를 통해 접근한 게시물에 관한 모든 법적 책임으로부터 “회사”를 면책하여야 하며, “회사”는 “서비스”를 통해 제공되는 다이어리와 계획서에 관해 아무런 책임을 지지 않습니다.\n" +
                    "“회원”의 “게시물”이 다음 각 호에 해당하거나 「정보통신망법」 및 「저작권법」등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 “게시물”의 게시중단 및 삭제 등을 요청할 수 있으며, “회사”는 관련법에 따라 조치를 취하여야 합니다.\n" +
                    "다른 회원 또는 제3자를 비방하거나 명예를 훼손시키는 내용인 경우\n" +
                    "공공질서 및 미풍양속에 위반되는 내용일 경우\n" +
                    "범죄행위와 결부된다고 인정되거나 종교적, 정치적, 사회적 분쟁을 일으킬 수 있는 경우\n" +
                    "회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우\n" +
                    "회사에서 규정한 게시기간을 초과한 경우\n" +
                    "해당 화면과 객관적으로 관련이 없는 내용\n" +
                    "회사로부터 사전 승인 받지 않고 상업광고, 판촉내용, 링크 등을 게시하는 경우\n" +
                    "타인의 계정정보, 성명 등을 무단으로 도용하여 작성한 내용이거나, 타인이 입력한 정보를 무단으로 위변조한 내용인 경우\n" +
                    "동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우\n" +
                    "기타 관계법령에 위배된다고 판단되는 경우\n" +
                    "“회사”는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 “게시물”을 삭제 및 임시조치 등을 취할 수 있습니다.\n" +
                    "본 조에 따른 세부절차는 「정보통신망법」 및 「저작권법」이 규정한 범위 내에서 “회사”가 정한 게시중단요청서비스에 따릅니다.\n" +
                    "게시중단요청서비스 : help@triple-corp.com\n" +
                    "\n" +
                    "제 16 조 (권리의 귀속)\n" +
                    "\n" +
                    "“서비스”에 대한 저작권 및 지식재산권은 “회사”에 귀속됩니다. 단, “회원”의 “게시물” 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.\n" +
                    "“회사”는 서비스와 관련하여 “회원”에게 “회사”가 정한 이용조건에 따라 계정, “아이디”, “콘텐츠”, “캐시” 등을 이용할 수 있는 이용권만을 부여하며, “회원”은 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.\n" +
                    "제 17 조 (계약의 성립)\n" +
                    "\n" +
                    "“회사”는 “이용자”의 제18조와 같은 구매신청에 따라 “판매자”에 대한 승낙의 요청 등 필요한 조치를 하며, “판매자”는 “이용자”의 구매신청이 다음 각호에 해당하면 승낙하지 않을 수 있습니다. 다만, 미성년자와 계약을 체결하는 경우에는 법정대리인의 동의를 얻지 못하면 미성년자 본인 또는 법정대리인이 계약을 취소할 수 있다는 내용을 고지하여야 합니다.\n" +
                    "신청 내용에 허위, 기재누락, 오기가 있는 경우\n" +
                    "미성년자가 담배, 주류 등 청소년보호법에서 금지하는 재화 및 용역을 구매하는 경우\n" +
                    "기타 구매신청에 승낙하는 것이 “회사” 기술상 현저히 지장이 있다고 판단하는 경우\n" +
                    "기타 제반 법령 및 정부의 가이드라인에 위반되는 경우\n" +
                    "\n" +
                    "제 18 조 (계약해제, 해지 등)\n" +
                    "\n" +
                    "“회원”은 언제든지 서비스초기화면의 고객센터 또는 내 정보 관리 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, “회사”는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다. 다만, 해지의사를 통지하기 전에 모든 재화의 판매 및 구매 절차를 완료, 철회 또는 취소해야만 합니다. 이 경우 판매 및 구매의 철회 또는 취소로 인한 불이익은 회원 본인이 부담하여야 합니다.\n" +
                    "“회원”이 계약을 해지할 경우, 관련법 및 개인정보처리방침에 따라 “회사”가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 “회원”의 모든 데이터는 소멸됩니다.\n" +
                    "“회원”이 계약을 해지하는 경우, “회원”이 작성한 “게시물” 중 본인 계정에 등록된 게시물 일체는 삭제됩니다. 다만, 타인의 게시물 또는 공용게시판에 등록된 “게시물” 등은 삭제되지 않으니 사전에 삭제 후 탈퇴해야합니다.\n" +
                    "이용계약 해지로 인해 발생한 불이익에 대한 책임은 회원 본인이 부담하여야 하며, 이용계약이 종료되면 “회사”는 회원에게 부가적으로 제공한 각종 무상혜택을 회수할 수 있습니다.\n" +
                    "회원이 다음 각 호의 사유에 해당하는 경우, “회사”는 이용계약을 해지하거나 회원 자격을 제한·정지시킬 수 있습니다.\n" +
                    "가입 신청 시에 허위 내용을 등록한 경우\n" +
                    "“서비스”를 이용하여 구입한 재화 등의 대금, 기타 “서비스”이용에 관련하여 “회원”이 부담하는 채무를 기일에 지급하지 않는 경우\n" +
                    "다른 사람의 “서비스” 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우\n" +
                    "“서비스”를 이용하여 법령 또는 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우\n" +
                    "기타 “회사”의 영업행위를 고의로 방해하는 행위를 하는 경우\n" +
                    "“회사”가 회원 자격을 제한·정지시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 “회사”는 이용계약을 해지할 수 있습니다.\n" +
                    "“회사”가 이용계약을 해지하는 경우 “회사”는 “회원”에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다. 다만, 본 약관 및 운영정책에서 정하는 사유가 있을 경우에는 별도의 이의 신청 기간을 부여하지 않을 수 있습니다.\n" +
                    "이용계약이 종료됨으로써 발생한 손해는 이용계약 종료사유에 대해 귀책사유가 있는 “회원”이 책임을 부담하여야 하고, “회사”는 관련 법령에 규정이 없는 한 책임을 지지 않습니다.\n" +
                    "제 19 조 (이용제한 등)\n" +
                    "\n" +
                    "“회사”는 “회원”이 본 약관의 의무를 위반하거나 “서비스”의 정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로 “서비스” 이용을 단계적으로 제한할 수 있습니다.\n" +
                    "“회사”는 전항에도 불구하고, “주민등록법”을 위반한 명의도용 및 결제도용, “저작권법” 및 “컴퓨터프로그램보호법”을 위반한 불법프로그램의 제공 및 운영방해, “정보통신망법”을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다. 본 항에 따른 영구이용정지 시 “서비스” 이용을 통해 획득한 “캐시” 및 기타 혜택 등도 모두 소멸되며, “회사”는 이에 대해 별도로 보상하지 않습니다.\n" +
                    "“회사”는 “회원”이 계속해서 1년 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 이용 제한하고, 휴면처리하여 별도DB에 분리보관할 수 있습니다.\n" +
                    "“회사”는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 이용제한정책 및 개별 서비스상의 운영정책에서 정하는 바에 의합니다.\n" +
                    "본 조에 따라 “서비스” 이용을 제한하거나 계약을 해지하는 경우에는 “회사”는 제8조[“이용자”에 대한 통지]에 따라 통지합니다.\n" +
                    "“회원”은 본 조에 따른 이용제한 등에 대해 “회사”가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 “회사”가 인정하는 경우 “회사”는 즉시 “서비스”의 이용을 재개합니다.\n" +
                    "제 20 조 (손해 배상)\n" +
                    "\n" +
                    "“이용자”가 본 약관의 규정을 위반함으로 인하여 “회사”에 손해가 발생하게 되는 경우, 본 약관을 위반한 “이용자”는 “회사”에 발생하는 손해를 배상하여야 합니다.\n" +
                    "“이용자”가 “서비스”를 이용하는 과정에서 행한 불법행위나 본 약관 위반행위로 인하여 “회사”가 당해 “이용자” 및 “이용자” 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 “이용자”는 자신의 책임과 비용으로 “회사”를 면책시켜야 하며, “회사”가 면책되지 못한 경우 당해 “이용자”는 그로 인하여 “회사”에 발생한 손해를 배상하여야 합니다. 다만, “회사”의 고의 또는 중과실로 발생한 손해에 대해서는 “회사”는 민법 등 관계 법령에 따라 책임을 부담합니다.\n" +
                    "제 21 조 (책임제한)\n" +
                    "\n" +
                    "“회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스”를 제공할 수 없는 경우에는 “서비스” 제공에 관한 책임이 면제됩니다.\n" +
                    "“회사”는 “이용자”의 귀책사유로 인한 “서비스” 이용(“이용자”가 제11조[“이용자”의 금지행위]에서 정한 행위를 통해 “서비스”를 이용한 경우를 포함합니다)의 장애에 대하여는 책임을 지지 않습니다.\n" +
                    "“회사”는 “이용자”가 “서비스”와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.\n" +
                    "“회사”는 “이용자” 간 또는 “이용자”와 제3자 상호간에 “서비스”를 매개로 하여 거래 등을 한 경우에는 책임이 면제됩니다.\n" +
                    "상품 등은 “판매자”의 책임 하에 관리, 운영되고, “회사”가 통신판매중개자로서의 지위를 가지는 경우 서비스 운영 상의 문제를 제외한 상품 등의 하자, 부실 등으로 인한 책임은 “판매자”에게 귀속되며, “회사”는 어떠한 책임도 부담하지 않습니다.\n" +
                    "“회사”는 무료로 제공되는 “서비스” 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.\n" +
                    "“회사”는 “회사” 및 “회사”의 임직원 그리고 “회사” 대리인의 고의 또는 중대한 과실이 없는 한 다음 각 호의 사항으로부터 발생하는 손해에 대해 책임을 지지 아니합니다.\n" +
                    "“회원” 정보 등의 허위 또는 부정확성에 기인하는 손해\n" +
                    "“서비스”에 대한 접속 및 “서비스”의 이용과정에서 발생하는 개인적인 손해\n" +
                    "서버에 대한 제3자의 모든 불법적인 접속 또는 서버의 불법적인 이용으로부터 발생하는 손해\n" +
                    "서버에 대한 전송 또는 서버로부터의 전송에 대한 제3자의 모든 불법적인 방해 또는 중단행위로부터 발생하는 손해\n" +
                    "제3자가 서비스를 이용하여 불법적으로 전송, 유포하거나 또는 전송, 유포되도록 한 모든 바이러스, 스파이웨어 및 기타 악성 프로그램으로 인한 손해\n" +
                    "전송된 데이터의 오류 및 생략, 누락, 파괴 등으로 발생되는 손해\n" +
                    "“회원”간의 “회원” 상태정보 등록 및 서비스 이용 과정에서 발생하는 명예훼손 기타 불법행위로 인한 각종 민∙형사상 책임\n" +
                    "제 22 조 (연결 회사와 피연결회사 간의 관계)\n" +
                    "\n" +
                    "상위 사이트와 하위 사이트가 하이퍼링크(예: 하이퍼링크의 대상에는 문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된 경우, 전자를 연결 회사(웹 사이트)이라고 하고 후자를 피연결 회사(웹사이트)이라고 합니다.\n" +
                    "연결회사는 피연결회사가 독자적으로 제공하는 재화 등에 의하여 “이용자”와 행하는 거래에 대해서 보증 책임을 지지 않는다는 뜻을 연결회사의 초기화면 또는 연결되는 시점에 명시한 경우에는 그 거래에 대한 보증 책임을 지지 않습니다.\n" +
                    "제 23 조 (분쟁해결)\n" +
                    "\n" +
                    "“회사”는 “이용자”가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 피해보상처리기구를 설치,운영합니다.\n" +
                    "“회사”는 “이용자”로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 “이용자”에게 그 사유와 처리일정을 즉시 통보해 드립니다.\n" +
                    "“회사”와 “이용자” 간에 발생한 전자상거래 분쟁과 관련하여 “이용자”의 피해구제신청이 있는 경우에는 공정거래위원회 또는 시•도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.\n" +
                    "제 24 조 (준거법 및 재판관할)\n" +
                    "\n" +
                    "“회사”와 “이용자” 간 제기된 모든 소송은 대한민국법을 준거법으로 합니다.\n" +
                    "“회사”와 “이용자” 간 발생한 분쟁에 관한 소송은 제소 당시의 “이용자”의 주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로 합니다. 단, 제소 당시 “이용자”의 주소 또는 거소가 명확하지 아니한 경우의 관할법원은 민사소송법에 따라 정합니다.\n" +
                    "해외에 주소나 거소가 있는 “이용자”의 경우 “회사”와 “이용자” 간 발생한 분쟁에 관한 소송은 전항에도 불구하고 대한민국 서울중앙지방법원을 관할법원으로 합니다.\n" +
                    "제 25 조 (특별규정)\n" +
                    "\n" +
                    "당 약관에 명시되지 않은 사항은 「전자거래기본법」, 「전자서명법」, 「전자상거래등에서의 소비자보호에 관한 법률」 기타 관련법령의 규정 및 국내외 여행표준약관 등에 의합니다.\n" +
                    "\n" +
                    "이 약관은 2023년 8월 15일부터 적용됩니다.\n"
    }
}